import random

#функция получения даты прописью
def data_1(data):
    day_list = ['первое', 'второе', 'третье', 'четвёртое',
                'пятое', 'шестое', 'седьмое', 'восьмое',
                'девятое', 'десятое', 'одиннадцатое', 'двенадцатое',
                'тринадцатое', 'четырнадцатое', 'пятнадцатое', 'шестнадцатое',
                'семнадцатое', 'восемнадцатое', 'девятнадцатое', 'двадцатое',
                'двадцать первое', 'двадцать второе', 'двадцать третье',
                'двадацать четвёртое', 'двадцать пятое', 'двадцать шестое',
                'двадцать седьмое', 'двадцать восьмое', 'двадцать девятое',
                'тридцатое', 'тридцать первое']
    month_list = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня',
                  'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря']
    day=int(data[:2])
    month=int(data[3:5])
    year=data[6:]

    return (day_list[day - 1] + ' ' +
     month_list[month - 1] + ' ' +
     year + ' года')


dict_datas={
    'Пушкин': '06.06.1799',
    'Гоголь': '01.04.1809',
    'Глинка': '01.06.1804',
    'Высоцкий': '25.01.1938',
    'Гончаров': '06.06.1812',
    'Лесков': '16.02.1831',
    'Некрасов': '28.01.1821',
    'Пришвин': '04.02.1873',
    'Толстой': '10.01.1883',
    'Тютчев': '23.11.1803'}

while True:
    print('Есть 10 известных людей и их даты рождения в формате 02.01.1988. '
          'Программа выбирает из этих 10-и 5 случайных людей. '
          'После того как выбраны 5 случайных людей, введите их дату рождения')
    result = random.sample(list(dict_datas.keys()), 5)

    print(result)

    count_right=0
    count_wrang=0

    for i in range(len(result)):
        a=input(f'Введите дату рождения писателя {result[i]}: ')
        if a==dict_datas[result[i]]:
            print('Правильно!')
            count_right+=1
        else:
            data_new=data_1(dict_datas[result[i]])
            print(f'Неправильно. Правильный ответ: {data_new}')
            count_wrang+=1
    print(f'Количество правильных ответов: {count_right}, Количество неправильных ответов: {count_wrang}')

    answer=input('Если хотите начать сначала введите "+", если нет, то "-"')
    if answer=='-':
        break